Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.browser.repoContext.error.noRepository
source: The selected repository is no longer available.
ar: المستودع المحدد لم يعد متاحًا.
de: Das ausgewählte Repository ist nicht mehr verfügbar.
es: El repositorio seleccionado ya no está disponible.
fr: Le dépôt sélectionné n'est plus disponible.
id: Repositori yang dipilih tidak lagi tersedia.
it: Il repository selezionato non è più disponibile.
ja: 選択したリポジトリはもう利用できません。
ko: 선택한 저장소를 더 이상 사용할 수 없습니다.
nl: De geselecteerde repository is niet langer beschikbaar.
pl: Wybrane repozytorium nie jest już dostępne.
pt_br: O repositório selecionado não está mais disponível.
ru: Выбранный репозиторий больше не доступен.
tr: Seçilen depo artık mevcut değil.
uk: Вибраний репозиторій більше недоступний.
vi: Kho lưu trữ đã chọn không còn khả dụng.
zh_hans: 当前选中的仓库已不可用。
zh_hant: 當前選中的倉庫已不可用。

# rag.browser.repoContext.generate
source: Generate RepoContext XML
ar: إنشاء RepoContext XML
de: RepoContext-XML generieren
es: Generar XML de RepoContext
fr: Générer le XML RepoContext
id: Hasilkan XML RepoContext
it: Genera XML di RepoContext
ja: RepoContext XML を生成
ko: RepoContext XML 생성
nl: RepoContext XML genereren
pl: Generuj plik RepoContext XML
pt_br: Gerar XML do RepoContext
ru: Сгенерировать RepoContext XML
tr: RepoContext XML Oluştur
uk: Згенерувати RepoContext XML
vi: Tạo RepoContext XML
zh_hans: 生成 RepoContext XML
zh_hant: 生成 RepoContext XML

# rag.browser.repoContext.generation.cacheHit
source: Repository commit and code context settings are unchanged; reused existing RepoContext XML
ar: تعهد المستودع وإعدادات سياق الكود لم تتغير؛ تم إعادة استخدام RepoContext XML الموجود
de: Repository-Commit und Code-Kontext-Einstellungen sind unverändert; vorhandenes RepoContext-XML wiederverwendet
es: El commit del repositorio y la configuración de contexto de código no han cambiado; se reutilizó el XML de RepoContext existente
fr: Le commit du dépôt et les paramètres de contexte de code sont inchangés ; le XML RepoContext existant a été réutilisé
id: Commit repositori dan pengaturan konteks kode tidak berubah; menggunakan XML RepoContext yang sudah ada
it: Il commit del repository e le impostazioni del contesto del codice sono invariati; riutilizzato il XML di RepoContext esistente
ja: リポジトリのコミットとコードコンテキスト設定が変更されていないため、既存の RepoContext XML を再利用しました
ko: 저장소 커밋 및 코드 컨텍스트 설정이 변경되지 않았습니다. 기존 RepoContext XML을 재사용했습니다.
nl: Repository-commit en codecontext-instellingen zijn ongewijzigd; bestaande RepoContext XML opnieuw gebruikt
pl: Zatwierdzenie repozytorium i ustawienia kontekstu kodu nie uległy zmianie; użyto istniejącego pliku RepoContext XML
pt_br: O commit do repositório e as configurações de contexto de código estão inalterados; XML do RepoContext existente foi reutilizado
ru: Коммит репозитория и настройки контекста кода не изменились; использован существующий RepoContext XML
tr: Depo commit ve kod bağlam ayarları değişmedi; mevcut RepoContext XML yeniden kullanıldı
uk: Коміт репозиторію та налаштування контексту коду не змінилися; використано наявний RepoContext XML
vi: Cam kết kho lưu trữ và cài đặt ngữ cảnh mã không thay đổi; đã sử dụng lại RepoContext XML hiện có
zh_hans: 仓库 commit 与代码上下文配置均未变化，已复用现有 RepoContext XML
zh_hant: 倉庫 commit 與程式碼上下文設定均未變更，已重複使用現有 RepoContext XML

# rag.browser.repoContext.generation.downloading
source: Download code
ar: تنزيل الكود
de: Code herunterladen
es: Descargar código
fr: Téléchargement du code
id: Unduh kode
it: Scarica codice
ja: コードをダウンロード
ko: 코드 다운로드 중
nl: Code downloaden
pl: Pobieranie kodu
pt_br: Baixar código
ru: Загрузка кода
tr: Kod indiriliyor
uk: Завантаження коду
vi: Tải mã xuống
zh_hans: 下载代码
zh_hant: 下載程式碼

# rag.browser.repoContext.generation.inProgress
source: RepoContext XML is being generated. Stop it before editing.
ar: يتم إنشاء RepoContext XML. أوقفه قبل التحرير.
de: RepoContext-XML wird generiert. Stoppen Sie es vor dem Bearbeiten.
es: Se está generando el XML de RepoContext. Detenlo antes de editar.
fr: Le XML RepoContext est en cours de génération. Arrêtez-le avant de modifier.
id: XML RepoContext sedang dibuat. Hentikan sebelum mengedit.
it: Il XML di RepoContext è in fase di generazione. Fermalo prima di modificare.
ja: RepoContext XML を生成中です。編集する前に停止してください。
ko: RepoContext XML이 생성 중입니다. 편집하려면 중지하세요.
nl: RepoContext XML wordt gegenereerd. Stop het voordat u bewerkt.
pl: Trwa generowanie pliku RepoContext XML. Zatrzymaj je przed edycją.
pt_br: O XML do RepoContext está sendo gerado. Pare-o antes de editar.
ru: RepoContext XML генерируется. Остановите его перед редактированием.
tr: RepoContext XML oluşturuluyor. Düzenlemeden önce durdurun.
uk: RepoContext XML генерується. Зупиніть його перед редагуванням.
vi: RepoContext XML đang được tạo. Hãy dừng nó trước khi chỉnh sửa.
zh_hans: RepoContext XML 正在生成，请先停止生成再编辑。
zh_hant: RepoContext XML 正在生成，請先停止生成再編輯。

# rag.browser.repoContext.generation.packing
source: Generate XML
ar: إنشاء XML
de: XML generieren
es: Generar XML
fr: Génération du XML
id: Hasilkan XML
it: Genera XML
ja: XML を生成
ko: XML 생성 중
nl: XML genereren
pl: Generuj XML
pt_br: Gerar XML
ru: Генерация XML
tr: XML oluştur
uk: Генерація XML
vi: Tạo XML
zh_hans: 生成 XML
zh_hant: 生成 XML

# rag.browser.repoContext.generation.resolving
source: Resolve repository
ar: حل المستودع
de: Repository auflösen
es: Resolver repositorio
fr: Résolution du dépôt
id: Selesaikan repositori
it: Risolvi repository
ja: リポジトリを解決
ko: 저장소 확인 중
nl: Repository oplossen
pl: Rozpoznawanie repozytorium
pt_br: Resolver repositório
ru: Разрешение репозитория
tr: Depo çözümleniyor
uk: Розпізнавання репозиторію
vi: Giải quyết kho lưu trữ
zh_hans: 解析仓库
zh_hant: 解析倉庫

# rag.browser.repoContext.generation.stop
source: Stop RepoContext generation
ar: إيقاف إنشاء RepoContext
de: RepoContext-Generierung stoppen
es: Detener generación de RepoContext
fr: Arrêter la génération du RepoContext
id: Hentikan pembuatan RepoContext
it: Ferma generazione RepoContext
ja: RepoContext 生成を停止
ko: RepoContext 생성 중지
nl: RepoContext-generatie stoppen
pl: Zatrzymaj generowanie RepoContext
pt_br: Parar geração do RepoContext
ru: Остановить генерацию RepoContext
tr: RepoContext oluşturmayı durdur
uk: Зупинити генерацію RepoContext
vi: Dừng tạo RepoContext
zh_hans: 停止生成 RepoContext
zh_hant: 停止生成 RepoContext

# rag.browser.repoContext.generation.succeeded
source: RepoContext XML generated
ar: تم إنشاء RepoContext XML
de: RepoContext-XML generiert
es: XML de RepoContext generado
fr: XML RepoContext généré
id: XML RepoContext berhasil dibuat
it: XML di RepoContext generato
ja: RepoContext XML を生成しました
ko: RepoContext XML이 생성되었습니다.
nl: RepoContext XML gegenereerd
pl: Plik RepoContext XML wygenerowany
pt_br: XML do RepoContext gerado
ru: RepoContext XML сгенерирован
tr: RepoContext XML oluşturuldu
uk: RepoContext XML згенеровано
vi: Đã tạo RepoContext XML
zh_hans: RepoContext XML 已生成
zh_hant: RepoContext XML 已生成

# rag.browser.repoContext.regenerate
source: Regenerate RepoContext XML
ar: إعادة إنشاء RepoContext XML
de: RepoContext-XML neu generieren
es: Regenerar XML de RepoContext
fr: Regénérer le XML RepoContext
id: Hasilkan ulang XML RepoContext
it: Rigenera XML di RepoContext
ja: RepoContext XML を再生成
ko: RepoContext XML 다시 생성
nl: RepoContext XML opnieuw genereren
pl: Wygeneruj ponownie plik RepoContext XML
pt_br: Regenerar XML do RepoContext
ru: Перегенерировать RepoContext XML
tr: RepoContext XML'i yeniden oluştur
uk: Перегенерувати RepoContext XML
vi: Tạo lại RepoContext XML
zh_hans: 重新生成 RepoContext XML
zh_hant: 重新生成 RepoContext XML

# rag.browser.repoContext.settings.action
source: Open AI Settings
ar: فتح إعدادات AI
de: KI-Einstellungen öffnen
es: Abrir ajustes de IA
fr: Ouvrir les réglages IA
id: Buka Pengaturan AI
it: Apri Impostazioni AI
ja: AI 設定を開く
ko: AI 설정 열기
nl: AI-instellingen openen
pl: Otwórz ustawienia AI
pt_br: Abrir Ajustes de IA
ru: Открыть настройки AI
tr: AI Ayarlarını Aç
uk: Відкрити налаштування AI
vi: Mở Cài đặt AI
zh_hans: 前往 AI 设置
zh_hant: 前往 AI 設定

# rag.browser.repoContext.settings.message
source: Enable code context in AI Settings before generating RepoContext XML. Starcat will not change this setting automatically.
ar: قم بتمكين سياق الكود في إعدادات AI قبل إنشاء RepoContext XML. لن يغير Starcat هذا الإعداد تلقائيًا.
de: Aktivieren Sie den Code-Kontext in den KI-Einstellungen, bevor Sie RepoContext-XML generieren. Starcat wird diese Einstellung nicht automatisch ändern.
es: Habilita el contexto de código en los ajustes de IA antes de generar el XML de RepoContext. Starcat no cambiará esta configuración automáticamente.
fr: Activez le contexte de code dans les réglages IA avant de générer le XML RepoContext. Starcat ne modifiera pas ce réglage automatiquement.
id: Aktifkan konteks kode di Pengaturan AI sebelum membuat XML RepoContext. Starcat tidak akan mengubah pengaturan ini secara otomatis.
it: Abilita il contesto del codice nelle Impostazioni AI prima di generare il XML di RepoContext. Starcat non modificherà questa impostazione automaticamente.
ja: RepoContext XML を生成する前に、AI 設定でコードコンテキストを有効にしてください。Starcat はこの設定を自動的に変更しません。
ko: RepoContext XML을 생성하기 전에 AI 설정에서 코드 컨텍스트를 활성화하세요. Starcat이 이 설정을 자동으로 변경하지 않습니다.
nl: Schakel codecontext in AI-instellingen in voordat u RepoContext XML genereert. Starcat zal deze instelling niet automatisch wijzigen.
pl: Włącz kontekst kodu w ustawieniach AI przed wygenerowaniem pliku RepoContext XML. Starcat nie zmieni tego ustawienia automatycznie.
pt_br: Ative o contexto de código nos Ajustes de IA antes de gerar o XML do RepoContext. O Starcat não alterará essa configuração automaticamente.
ru: Включите контекст кода в настройках AI перед генерацией RepoContext XML. Starcat не будет менять этот параметр автоматически.
tr: RepoContext XML oluşturmadan önce AI Ayarları'nda kod bağlamını etkinleştirin. Starcat bu ayarı otomatik olarak değiştirmez.
uk: Увімкніть контекст коду в налаштуваннях AI перед генерацією RepoContext XML. Starcat не змінюватиме це налаштування автоматично.
vi: Bật ngữ cảnh mã trong Cài đặt AI trước khi tạo RepoContext XML. Starcat sẽ không tự động thay đổi cài đặt này.
zh_hans: 请先在 AI 设置中开启代码上下文，再生成 RepoContext XML。Starcat 不会自动修改此设置。
zh_hant: 請先在 AI 設定中開啟程式碼上下文，再生成 RepoContext XML。Starcat 不會自動修改此設定。

# rag.browser.repoContext.settings.title
source: Code Context Is Disabled
ar: سياق الكود معطل
de: Code-Kontext ist deaktiviert
es: El contexto de código está deshabilitado
fr: Contexte de code désactivé
id: Konteks Kode Dinonaktifkan
it: Contesto del codice disabilitato
ja: コードコンテキストが無効です
ko: 코드 컨텍스트가 비활성화됨
nl: Codecontext is uitgeschakeld
pl: Kontekst kodu jest wyłączony
pt_br: Contexto de Código Está Desativado
ru: Контекст кода отключён
tr: Kod Bağlamı Devre Dışı
uk: Контекст коду вимкнено
vi: Ngữ cảnh mã đã bị tắt
zh_hans: 代码上下文未开启
zh_hant: 程式碼上下文未開啟

# rag.browser.repositories
source: Repositories
ar: المستودعات
de: Repositorys
es: Repositorios
fr: Dépôts
id: Repositori
it: Repository
ja: リポジトリ
ko: 저장소
pl: Repozytoria
pt_br: Repositórios
ru: Репозитории
tr: Depolar
uk: Репозиторії
vi: Kho lưu trữ
zh_hans: 仓库
zh_hant: 倉庫

# rag.browser.retrieval.detail
source: Retrieved chunk
ar: القطعة المسترجعة
de: Abgerufener Chunk
es: Fragmento recuperado
fr: Fragment récupéré
id: Potongan yang diambil
it: Chunk recuperato
ja: 取得されたチャンク
ko: 검색된 청크
nl: Opgehaalde chunk
pl: Pobrany fragment
pt_br: Fragmento recuperado
ru: Извлечённый чанк
tr: Alınan parça
uk: Отриманий фрагмент
vi: Đoạn đã truy xuất
zh_hans: 命中分片详情
zh_hant: 命中分片詳情

# rag.browser.retrieval.noHitsMessage
source: Try rephrasing the question or refreshing the index.
ar: حاول إعادة صياغة السؤال أو تحديث الفهرس.
de: Versuchen Sie, die Frage umzuformulieren oder den Index zu aktualisieren.
es: Intenta reformular la pregunta o actualizar el índice.
fr: Essayez de reformuler la question ou d'actualiser l'index.
id: Coba ulangi pertanyaan atau segarkan indeks.
it: Prova a riformulare la domanda o ad aggiornare l'indice.
ja: 質問を言い換えるか、インデックスを更新してみてください。
ko: 질문을 다시 표현하거나 인덱스를 새로 고쳐 보세요.
nl: Probeer de vraag anders te formuleren of de index te vernieuwen.
pl: Spróbuj przeformułować pytanie lub odświeżyć indeks.
pt_br: Tente reformular a pergunta ou atualizar o índice.
ru: Попробуйте переформулировать вопрос или обновить индекс.
tr: Soruyu yeniden ifade etmeyi veya dizini yenilemeyi deneyin.
uk: Спробуйте переформулювати запитання або оновити індекс.
vi: Hãy thử diễn đạt lại câu hỏi hoặc làm mới chỉ mục.
zh_hans: 可调整问题后重试，或刷新索引后再测试。
zh_hant: 可調整問題後重試，或重新整理索引後再測試。

# rag.browser.retrieval.noHitsTitle
source: No matching chunks
ar: لا توجد قطع مطابقة
de: Keine passenden Chunks
es: Sin fragmentos coincidentes
fr: Aucun fragment correspondant
id: Tidak ada potongan yang cocok
it: Nessun chunk corrispondente
ja: 一致するチャンクがありません
ko: 일치하는 청크 없음
nl: Geen overeenkomende chunks
pl: Brak pasujących fragmentów
pt_br: Nenhum fragmento correspondente
ru: Нет подходящих чанков
tr: Eşleşen parça yok
uk: Немає відповідних фрагментів
vi: Không có đoạn phù hợp
zh_hans: 未命中分片
zh_hant: 未命中分片

# rag.browser.retrieval.placeholder
source: Enter a question to inspect retrieved chunks
ar: أدخل سؤالاً لفحص القطع المسترجعة
de: Geben Sie eine Frage ein, um abgerufene Chunks zu prüfen
es: Ingresa una pregunta para inspeccionar los fragmentos recuperados
fr: Saisissez une question pour inspecter les fragments récupérés
id: Masukkan pertanyaan untuk memeriksa potongan yang diambil
it: Inserisci una domanda per ispezionare i chunk recuperati
ja: 取得されたチャンクを確認するには質問を入力してください
ko: 검색된 청크를 확인하려면 질문을 입력하세요.
nl: Voer een vraag in om opgehaalde chunks te inspecteren
pl: Wpisz pytanie, aby sprawdzić pobrane fragmenty
pt_br: Digite uma pergunta para inspecionar os fragmentos recuperados
ru: Введите вопрос для просмотра извлечённых чанков
tr: Alınan parçaları incelemek için bir soru girin
uk: Введіть запитання, щоб переглянути отримані фрагменти
vi: Nhập câu hỏi để kiểm tra các đoạn đã truy xuất
zh_hans: 输入问题，查看命中的分片
zh_hant: 輸入問題，查看命中的分片

# rag.browser.retrieval.rankScore
source: Hybrid retrieval score
ar: درجة الاسترجاع الهجين
de: Hybrider Abruf-Score
es: Puntuación de recuperación híbrida
fr: Score de récupération hybride
id: Skor pengambilan hibrida
it: Punteggio di recupero ibrido
ja: ハイブリッド検索スコア
ko: 하이브리드 검색 점수
nl: Hybride ophaalscore
pl: Wynik wyszukiwania hybrydowego
pt_br: Pontuação de recuperação híbrida
ru: Оценка гибридного поиска
tr: Hibrit alma puanı
uk: Оцінка гібридного пошуку
vi: Điểm truy xuất kết hợp
zh_hans: 综合检索分
zh_hant: 綜合檢索分

# rag.browser.retrieval.run
source: Test retrieval
ar: اختبار الاسترجاع
de: Abruf testen
es: Probar recuperación
fr: Tester la récupération
id: Uji pengambilan
it: Test recupero
ja: 検索をテスト
ko: 검색 테스트
nl: Ophalen testen
pl: Testuj wyszukiwanie
pt_br: Testar recuperação
ru: Тестовый поиск
tr: Almayı test et
uk: Тестувати пошук
vi: Kiểm tra truy xuất
zh_hans: 测试召回
zh_hant: 測試召回

# rag.browser.retrieval.settings.draftHint
source: Applies to this test only
ar: ينطبق على هذا الاختبار فقط
de: Gilt nur für diesen Test
es: Se aplica solo a esta prueba
fr: S'applique uniquement à ce test
id: Berlaku untuk pengujian ini saja
it: Si applica solo a questo test
ja: このテストのみに適用
ko: 이 테스트에만 적용됩니다.
nl: Alleen van toepassing op deze test
pl: Dotyczy tylko tego testu
pt_br: Aplica-se apenas a este teste
ru: Применяется только к этому тесту
tr: Yalnızca bu test için geçerlidir
uk: Застосовується лише до цього тесту
vi: Chỉ áp dụng cho bài kiểm tra này
zh_hans: 仅用于本次测试
zh_hant: 僅用於本次測試

# rag.browser.retrieval.settings.restore
source: Restore Saved
ar: استعادة المحفوظ
de: Gespeicherte wiederherstellen
es: Restaurar guardado
fr: Restaurer les sauvegardes
id: Kembalikan ke Tersimpan
it: Ripristina salvati
ja: 保存済みを復元
ko: 저장된 설정 복원
nl: Opgeslagen herstellen
pl: Przywróć zapisane
pt_br: Restaurar Salvo
ru: Восстановить сохранённые
tr: Kaydedileni Geri Yükle
uk: Відновити збережене
vi: Khôi phục đã lưu
zh_hans: 恢复已保存配置
zh_hant: 恢復已儲存設定

# rag.browser.retrieval.settings.save
source: Save as RAG Settings
ar: حفظ كإعدادات RAG
de: Als RAG-Einstellungen speichern
es: Guardar como configuración RAG
fr: Enregistrer comme paramètres RAG
id: Simpan sebagai Pengaturan RAG
it: Salva come impostazioni RAG
ja: RAG 設定として保存
ko: RAG 설정으로 저장
nl: Opslaan als RAG-instellingen
pl: Zapisz jako ustawienia RAG
pt_br: Salvar como Configurações de RAG
ru: Сохранить как настройки RAG
tr: RAG Ayarları Olarak Kaydet
uk: Зберегти як налаштування RAG
vi: Lưu dưới dạng Cài đặt RAG
zh_hans: 保存为 RAG 配置
zh_hant: 儲存為 RAG 設定

# rag.browser.retrieval.settings.title
source: Test Parameters
ar: معاملات الاختبار
de: Testparameter
es: Parámetros de prueba
fr: Paramètres de test
id: Parameter Uji
it: Parametri di test
ja: テストパラメータ
ko: 테스트 매개변수
pl: Parametry testu
pt_br: Parâmetros de Teste
ru: Параметры теста
tr: Test Parametreleri
uk: Параметри тесту
vi: Tham số kiểm tra
zh_hans: 测试参数
zh_hant: 測試參數

# rag.browser.retrieval.settings.unsaved
source: Unsaved
ar: غير محفوظ
de: Nicht gespeichert
es: Sin guardar
fr: Non enregistré
id: Belum Disimpan
it: Non salvato
ja: 未保存
ko: 저장되지 않음
nl: Niet opgeslagen
pl: Niezapisane
pt_br: Não salvo
ru: Не сохранено
tr: Kaydedilmemiş
uk: Незбережено
vi: Chưa lưu
zh_hans: 未保存
zh_hant: 未儲存

# rag.browser.retrieval.summary.format
source: Threshold %.2f · Vector %lld · Threshold filtered %lld · Final %lld
ar: العتبة %.2f · المتجه %lld · تمت تصفية العتبة %lld · النهائي %lld
de: Schwellenwert %.2f · Vektor %lld · Schwellenwert gefiltert %lld · Endgültig %lld
es: Umbral %.2f · Vector %lld · Filtrado por umbral %lld · Final %lld
fr: Seuil %.2f · Vecteur %lld · Seuil filtré %lld · Final %lld
id: Ambang %.2f · Vektor %lld · Difilter ambang %lld · Akhir %lld
it: Soglia %.2f · Vettore %lld · Soglia filtrata %lld · Finale %lld
ja: しきい値 %.2f · ベクトル %lld · しきい値フィルタ後 %lld · 最終 %lld
ko: 임계값 %.2f · 벡터 %lld · 임계값 필터링됨 %lld · 최종 %lld
nl: Drempelwaarde %.2f · Vector %lld · Drempel gefilterd %lld · Definitief %lld
pl: Próg %.2f · Wektor %lld · Próg filtrowany %lld · Ostatecznie %lld
pt_br: Limiar %.2f · Vetor %lld · Filtrado por limiar %lld · Final %lld
ru: Порог %.2f · Вектор %lld · Фильтр по порогу %lld · Итог %lld
tr: Eşik %.2f · Vektör %lld · Eşik filtrelenmiş %lld · Son %lld
uk: Поріг %.2f · Вектор %lld · Відфільтровано за порогом %lld · Остаточно %lld
vi: Ngưỡng %.2f · Vector %lld · Lọc ngưỡng %lld · Cuối cùng %lld
zh_hans: 阈值 %.2f · 向量命中 %lld · 阈值过滤 %lld · 最终保留 %lld
zh_hant: 閾值 %.2f · 向量命中 %lld · 閾值過濾 %lld · 最終保留 %lld

# rag.browser.retrieval.title
source: Retrieval test
ar: اختبار الاسترجاع
es: Prueba de recuperación
fr: Test de récupération
id: Uji pengambilan
it: Test di recupero
ja: 検索テスト
ko: 검색 테스트
pl: Test wyszukiwania
pt_br: Teste de recuperação
ru: Тест поиска
tr: Alma testi
uk: Тест пошуку
vi: Kiểm tra truy xuất
zh_hans: 召回测试
zh_hant: 召回測試

# rag.browser.retrieval.vectorSimilarity
source: Vector similarity
ar: تشابه المتجهات
de: Vektorähnlichkeit
es: Similitud vectorial
fr: Similarité vectorielle
id: Kemiripan vektor
it: Similarità vettoriale
ja: ベクトル類似度
ko: 벡터 유사도
nl: Vectorovereenkomst
pl: Podobieństwo wektorowe
pt_br: Similaridade vetorial
ru: Векторное сходство
tr: Vektör benzerliği
uk: Векторна схожість
vi: Tương đồng vector
zh_hans: 向量相似度
zh_hant: 向量相似度

# rag.browser.source.metadata
source: Metadata
ar: البيانات الوصفية
de: Metadaten
es: Metadatos
fr: Métadonnées
it: Metadati
ja: メタデータ
ko: 메타데이터
pl: Metadane
pt_br: Metadados
ru: Метаданные
tr: Meta veri
uk: Метадані
vi: Siêu dữ liệu
zh_hans: 元数据
zh_hant: 元數據

# rag.browser.source.notes
source: Notes
ar: ملاحظات
de: Notizen
es: Notas
id: Catatan
it: Note
ja: ノート
ko: 노트
nl: Notities
pl: Notatki
pt_br: Notas
ru: Заметки
tr: Notlar
uk: Нотатки
vi: Ghi chú
zh_hans: 笔记
zh_hant: 筆記

# rag.browser.source.summary
source: Summary
ar: ملخص
de: Zusammenfassung
es: Resumen
fr: Résumé
id: Ringkasan
it: Riepilogo
ja: 概要
ko: 요약
nl: Samenvatting
pl: Podsumowanie
pt_br: Resumo
ru: Сводка
tr: Özet
uk: Підсумок
vi: Tóm tắt
zh_hans: 摘要
zh_hant: 摘要

# rag.browser.status.available
source: Available
ar: متاح
de: Verfügbar
es: Disponible
fr: Disponible
id: Tersedia
it: Disponibile
ja: 利用可能
ko: 사용 가능
nl: Beschikbaar
pl: Dostępne
pt_br: Disponível
ru: Доступно
tr: Kullanılabilir
uk: Доступно
vi: Khả dụng
zh_hans: 可用
zh_hant: 可用

# rag.browser.status.failed
source: Failed
ar: فشل
de: Fehlgeschlagen
es: Falló
fr: Échec
id: Gagal
it: Non riuscito
ja: 失敗
ko: 실패
nl: Mislukt
pl: Niepowodzenie
pt_br: Falhou
ru: Ошибка
tr: Başarısız
uk: Помилка
vi: Thất bại
zh_hans: 失败
zh_hant: 失敗

# rag.browser.status.keywordOnly
source: Keyword only
ar: الكلمات المفتاحية فقط
de: Nur Stichwort
es: Solo palabras clave
fr: Mot-clé uniquement
id: Hanya kata kunci
it: Solo parole chiave
ja: キーワードのみ
ko: 키워드 전용
nl: Alleen trefwoord
pl: Tylko słowa kluczowe
pt_br: Apenas palavras-chave
ru: Только ключевые слова
tr: Yalnızca anahtar kelime
uk: Лише ключові слова
vi: Chỉ từ khóa
zh_hans: 仅关键词
zh_hant: 僅關鍵詞

# rag.browser.status.pending
source: Pending
ar: قيد الانتظار
de: Ausstehend
es: Pendiente
fr: En attente
id: Menunggu
it: In attesa
ja: 保留中
ko: 대기 중
nl: In behandeling
pl: Oczekujące
pt_br: Pendente
ru: Ожидание
tr: Beklemede
uk: Очікування
vi: Đang chờ
zh_hans: 待处理
zh_hant: 待處理

# rag.browser.status.ready
source: Ready
ar: جاهز
de: Bereit
es: Listo
fr: Prêt
id: Siap
it: Pronto
ja: 準備完了
ko: 준비
nl: Gereed
pl: Gotowe
pt_br: Pronto
ru: Готово
tr: Hazır
uk: Готово
vi: Sẵn sàng
zh_hans: 可用
zh_hant: 可用

# rag.browser.status.stale
source: Stale
ar: قديم
de: Veraltet
es: Desactualizado
fr: Obsolète
id: Kedaluwarsa
it: Obsoleto
ja: 古い
ko: 오래됨
nl: Verouderd
pl: Nieaktualne
pt_br: Desatualizado
ru: Устарело
tr: Eski
uk: Застаріло
vi: Cũ
zh_hans: 过期
zh_hant: 過期

# rag.browser.status.unavailable
source: Unavailable
ar: غير متاح
de: Nicht verfügbar
es: No disponible
fr: Indisponible
id: Tidak Tersedia
it: Non disponibile
ja: 利用不可
ko: 사용 불가
nl: Niet beschikbaar
pl: Niedostępne
pt_br: Indisponível
ru: Недоступно
tr: Kullanılamaz
uk: Недоступно
vi: Không khả dụng
zh_hans: 不可用
zh_hant: 不可用

# rag.browser.subtitle
source: Repositories and content available to RAG
ar: المستودعات والمحتوى المتاح لـ RAG
de: Repositories und Inhalte, die für RAG verfügbar sind
es: Repositorios y contenido disponibles para RAG
fr: Dépôts et contenu disponibles pour le RAG
id: Repositori dan konten yang tersedia untuk RAG
it: Repository e contenuti disponibili per RAG
ja: RAG で利用可能なリポジトリとコンテンツ
ko: RAG에서 사용할 수 있는 저장소 및 콘텐츠
nl: Repositories en inhoud beschikbaar voor RAG
pl: Repozytoria i treści dostępne dla RAG
pt_br: Repositórios e conteúdo disponíveis para RAG
ru: Репозитории и контент, доступные для RAG
tr: RAG için kullanılabilir depolar ve içerik
uk: Репозиторії та вміст, доступні для RAG
vi: Kho lưu trữ và nội dung có sẵn cho RAG
zh_hans: 查看 RAG 当前可检索的仓库与内容
zh_hant: 查看 RAG 當前可檢索的倉庫與內容

# rag.browser.title
source: Knowledge Base
ar: قاعدة المعرفة
de: Wissensdatenbank
es: Base de conocimiento
fr: Base de connaissances
id: Basis Pengetahuan
ja: ナレッジベース
ko: 지식 베이스
nl: Kennisbank
pl: Baza wiedzy
pt_br: Base de Conhecimento
ru: База знаний
tr: Bilgi Tabanı
uk: База знань
vi: Cơ sở tri thức
zh_hans: 知识库
zh_hant: 知識庫

# rag.browser.totalChunks
source: Total chunks
ar: إجمالي القطع
de: Gesamtzahl der Chunks
es: Fragmentos totales
fr: Total des chunks
id: Total potongan
it: Chunk totali
ja: 総チャンク数
ko: 총 청크 수
nl: Totaal aantal chunks
pl: Łączna liczba fragmentów
pt_br: Total de blocos
ru: Всего фрагментов
tr: Toplam yığın
uk: Усього фрагментів
vi: Tổng số chunk
zh_hans: 分片总数
zh_hant: 分片總數
